Repository: maib-ecomm/maib-payment-gateway-for-woocommerce
Catalog: languages/maib-payment-gateway-for-woocommerce-*.po
Languages: ro_ro, ru_ru

source: Accept Visa / Mastercard / Apple Pay / Google Pay on your store with the Maib Payment Gateway for WooCommerce.
ro_ro: Acceptați Visa / Mastercard / Apple Pay / Google Pay în magazinul dvs. online cu Maib Payment Gateway for WooCommerce.
ru_ru: Принимайте Visa / Mastercard / Apple Pay / Google Pay в своем интернет-магазине с помощью Maib Payment Gateway for WooCommerce.

source: Add these links to the Project settings in maibmerchants.md
ro_ro: Adăugați aceste link-uri la Setările Proiectului în <b>maibmerchants.md</b>
ru_ru: Добавьте эти ссылки в настройки Проекта в maibmerchants.md

source: Complete Two-Step Payment
ro_ro: Finisare plată în 2 etape
ru_ru: Завершить двухэтапный платеж

source: Complete Two-Step payment failed! Please see Maib Payment Gateway logs.
ro_ro: Finisarea plății în 2 etape a eșuat. Vedeți log-urile Maib Payment Gateway.
ru_ru: Не удалось завершить двухэтапный платеж! Смотрите логи Maib Payment Gateway .

source: Complete Two-Step payment not possible, payment id missing.
ro_ro: Nu este posibilă finisarea plății în 2 etape. Lipsește ID-ul plății.
ru_ru: Завершить двухэтапный платеж невозможно, идентификатор maib платежа отсутствует.

source: Connection Settings - <a href="https://maibmerchants.md" target="_blank">maibmerchants.md</a>
ro_ro: Setări conectare - <a href="https://maibmerchants.md" target="_blank">maibmerchants.md</a>
ru_ru: Настройки подключения - <a href="https://maibmerchants.md" target="_blank">maibmerchants.md</a>

source: Debug mode
ro_ro: Mod depanare
ru_ru: Режим отладки

source: Default status
ro_ro: Stare implicită
ru_ru: Статус по умолчанию

source: Description
ro_ro: Descriere
ru_ru: Описание

source: Direct Payment
ro_ro: Plăți Directe
ru_ru: Прямой Платеж

source: Direct payment - if the transaction is successful the amount is withdrawn from the customer account. Two-step payment - if the transaction is successful the amount is just on hold on the customer account, to withdraw the amount use the Order action: Complete Two-Step Payment.
ro_ro: Plata directă - în cazul în care tranzacția este reușită, suma este retrasă din contul clientului. Plata în 2 etape - în cazul în care tranzacția este reușită, suma este doar reținută în contul clientului; pentru a retrage suma, utilizați Acțiune Comandă: Finisare plată în 2 etape.
ru_ru: Прямой платеж - если транзакция успешна, сумма списывается со счета клиента. Двухэтапный платеж - если транзакция успешна, сумма просто блокируется на счете клиента, чтобы списать сумму, используйте из Доступные действия в заказе: Завершить двухэтапный платеж.

source: Enable logging
ro_ro: Activare depanare
ru_ru: Включить логирование

source: Enable Maib Payment Gateway
ro_ro: Activare Maib Payment Gateway
ru_ru: Включить платежный шлюз

source: Enable/Disable
ro_ro: Activare/Dezactivare
ru_ru: Включить/Выключить

source: Format: <code>%1$s</code> - Order ID, <code>%2$s</code> - Order items summary
ro_ro: Format: <code>%1$s</code> - ID Comandă, <code>%2$s</code> - Denumirile produselor
ru_ru: Формат: <code>%1$s</code> - номер заказа, <code>%2$s</code> - наименование товаров

source: It is available after Project activation.
ro_ro: Este disponibil după activarea Proiectului.
ru_ru: Доступен после активации Проекта.

source: It is available after registration.
ro_ro: Este disponibil după înregistrarea pe platformă.
ru_ru: Доступен после регистрации.

source: Maib Payment Gateway for WooCommerce
ru_ru: Maib Payment Gateway для WooCommerce

source: One or more of the required fields (Project ID, Project Secret, Signature Key) is empty in Maib Payment Gateway settings.
ro_ro: Unul sau mai multe dintre câmpurile obligatorii (Project ID, Project Secret, Signature Key) nu au fost completate în setările Maib Payment Gateway.
ru_ru: Одно или несколько обязательных полей (Project ID, Project Secret, Signature Key) не заполнены в настройках Maib Payment Gateway.

source: Order #%1$s payment failed via %2$s. %3$s
ro_ro: Achitarea comenzii #%1$s prin %2$s a eșuat. %3$s
ru_ru: Не удалось оплатить заказ #%1$s через %2$s. %3$s

source: Order description
ro_ro: Descriere comandă
ru_ru: Описание заказа

source: Order description that the customer will see on the bank payment page.
ro_ro: Descrierea comenzii afișate clientului pe pagina unde introducere datele cardului.
ru_ru: Описание заказа, отображаемое покупателю на странице ввода данных карты.

source: Order status
ro_ro: Starea comenzii
ru_ru: Статус заказа

source: Order status when payment failed. By default: Failed.
ro_ro: Starea comenzii dacă tranzacția a eșuat. Implicit: Eșuată.
ru_ru: Статус заказа, когда оплата не удалась. По умолчанию: Не удалась.

source: Order status when payment on hold. By default: On hold.
ro_ro: Starea comenzii dacă tranzacția este autorizată (plăți în 2 etape). Implicit: În așteptare.
ru_ru: Статус заказа при авторизации платежа (двухэтапный платеж). По умолчанию: На удержании.

source: Pay online
ro_ro: Achită Online
ru_ru: Оплатить онлайн

source: Payment (%1$s) failed.
ro_ro: Plata (%1$s) a eșuat.
ru_ru: Платеж (%1$s) не удался.

source: Payment (%1$s) on hold.
ro_ro: Plată (%1$s) în așteptare.
ru_ru: Платеж (%1$s) авторизован (on hold).

source: Payment (%1$s) successful.
ro_ro: Plată (%1$s) cu succes.
ru_ru: Платеж (%1$s) прошел успешно.

source: Payment already refunded!
ro_ro: Plată deja returnată! Nu este posibilă returnarea repetată.
ru_ru: Этот платеж был уже возвращен!

source: Payment completed
ro_ro: Plată cu succes
ru_ru: Платеж завершен

source: Payment failed
ro_ro: Plată eșuată
ru_ru: Платеж не удался

source: Payment initiation failed via maib gateway, please try again later.
ro_ro: Inițierea plății prin Maib Gateway a eșuat. Vă rugăm să ne contactați sau încercați mai tîrziu.
ru_ru: Не удалось инициировать платеж через шлюз Maib Payment Gateway. Свяжитесь с нами или повторите попытку позже.

source: Payment method description that the customer will see during checkout.
ro_ro: Descrierea metodei de plată afișată cumpărătorului la achitare.
ru_ru: Описание способа оплаты, которое покупатель увидит при оформлении заказа.

source: Payment method title that the customer will see during checkout.
ro_ro: Denumirea metodei de plată afișată cumpărătorului la achitare.
ru_ru: Название способа оплаты, которое покупатель увидит при оформлении заказа.

source: Project Settings
ro_ro: Setări Proiect
ru_ru: Настройки Проекта

source: Refund failed! Please see Maib Payment Gateway logs.
ro_ro: Returnarea a eșuat! Vedeți log-urile Maib Payment Gateway.
ru_ru: Возврат не удался! Смотрите логи Maib Payment Gateway.

source: Refund not possible, payment ID missing in order data.
ro_ro: Returnarea nu este posibilă, ID-ul de plată maib lipsește în datele comenzii.
ru_ru: Возврат невозможен, ID платежа maib отсутствует в данных заказа.

source: Save debug messages to the WooCommerce System Status logs. Note: this may log personal information. Use this for debugging purposes only and delete the logs when finished.
ro_ro: Activarea înregistrării mesajelor cu erori în sistemul de Jurnale WooCommerce. Activați numai în scopuri de depanare și ștergeți jurnalele când nu sunt careva erori la achitare.
ru_ru: Сохраняйте отладочные сообщения в журналы состояния системы WooCommerce.

source: Settings
ro_ro: Setează
ru_ru: Настройки

source: Something went wrong on redirect to website! Please contact us.
ro_ro: A apărut o eroare la redirecționarea către website. Vă rugăm să ne contactați pentru asistență.
ru_ru: Что-то пошло не так при перенаправлении на сайт! Пожалуйста свяжитесь с нами.

source: The completed order status after successful payment. By default: Processing.
ro_ro: Starea comenzii dacă tranzacția s-a finalizat cu succes. Implicit: În procesare.
ru_ru: Статус выполненного заказа после успешной оплаты. По умолчанию: Обработка.

source: This Callback URL works and should not be called directly.
ro_ro: Acest Callback URL funcționează și nu poate fi accesat direct.
ru_ru: Этот Callback URL работает и не должен вызываться напрямую.

source: This currency is not supported by Maib Payment Gateway. Please choose a different currency (MDL / EUR / USD).
ro_ro: Această valută nu este acceptată de către Maib Payment Gateway. Vă rugăm să alegeți altă valută (MDL / EUR / USD).
ru_ru: Эта валюта не поддерживается платежным шлюзом <b>maib</b>. Пожалуйста, выберите другую валюту (MDL / EUR / USD).

source: Title
ro_ro: Denumire
ru_ru: Заголовок

source: Transaction type
ro_ro: Tipul plăților
ru_ru: Тип платежей

source: Two-Step Payment
ro_ro: Plăți în 2 etape
ru_ru: Двухэтапный Платеж

source: Two-Step Payment authorized
ro_ro: Plată în 2 etape autorizată
ru_ru: Двухэтапный платеж авторизован

source: View logs
ro_ro: Vezi jurnalele
ru_ru: Посмотреть логи
